const NewsList = [
  {
    category: "CAT1",
    title: "タイトルタイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p><a target='_blank' href='#'>外部リンク外部リンク外部リンク</a></p>"
      + "<p><a target='_blank' href='#'>外部リンク外部リンク外部リンク</a></p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
      { img: 'news03.jpg' },
      { img: 'news02.jpg' },
      { img: 'news01.jpg' },
    ]
  },
  {
    category: "CAT2",
    title: "タイトルタイトルタイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT3",
    title: "タイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT1",
    title: "タイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT2",
    title: "タイトルタイトルタイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT2",
    title: "タイトルタイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT1",
    title: "タイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT1",
    title: "タイトルタイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT1",
    title: "タイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT1",
    title: "タイトルタイトルタイトルタイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT3",
    title: "タイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT3",
    title: "タイトルタイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT3",
    title: "タイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT3",
    title: "タイトルタイトルタイトルタイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT3",
    title: "タイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT2",
    title: "タイトルタイトルタイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
  {
    category: "CAT2",
    title: "タイトルタイトルタイトルタイトルタイトル",
    date: "2019.11.20",
    content:
      "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>"
      + "<p>テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>",
    image: [
      { img: 'news01.jpg' },
      { img: 'news02.jpg' },
    ]
  },
]
export default {
  fetch(id) { return NewsList },
  find(id) { return NewsList.find(el => el.id === id) },
  asyncFind(id, callback) {
    setTimeout(() => {
      callback(NewsList.find(el => el.id === id))
    }, 1000)
  }
}
